from random import randint

n = int(input('Введите количество камней в куче (больше 0): '))
if n <= 0:
  print('Количество камней должно быть больше 0!')

print('Правила игры: каждый ход игрок и компьютер берут от 1 до 3 камней из кучи. Побеждает тот, кто забрал последний камень.')

count = 0
while n > 0:
    count = count +1
    if count % 2 == 0:
        comp = randint(1,3)
        print(f' Компьютер взял {comp} камней')
        n = n - comp
        print(f'Количество камней осталось {n}')
        if n <= 0: 
            print('Компьютер победил тебя')
    else:
        player = int(input('Введите кол-во камней (от 1 до 3): '))
        print(f'Вы взяли {player} камней')
        if player < 1 or player > 3 or player > n:
            print('Вы ошиблись! Введите число от 1 до 3, не превышающее количество камней в куче.')
            player = int(input("Введите кол-во камней (от 1 до 3): "))
        n = n - player
        print(f'Количество камней осталось {n}')
        if n <= 0: print('Вы победили!')