# # В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.

# # В случае с английским алфавитом очки распределяются так:

# # A, E, I, O, U, L, N, S, T, R – 1 очко;
# # D, G – 2 очка;
# # B, C, M, P – 3 очка;
# # F, H, V, W, Y – 4 очка;
# # K – 5 очков;
# # J, X – 8 очков;
# # Q, Z – 10 очков.
# # А русские буквы оцениваются так:

# # А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# # Д, К, Л, М, П, У – 2 очка;
# # Б, Г, Ё, Ь, Я – 3 очка;
# # Й, Ы – 4 очка;
# # Ж, З, Х, Ц, Ч – 5 очков;
# # Ш, Э, Ю – 8 очков;
# # Ф, Щ, Ъ – 10 очков.
# # Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его. Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

k = 'рагнарек'
# # 12

char_list = []  # объявляем пустой список

for c in k: # идем по строке
    char_list.append(c) # добавляем буквы в список
# print(char_list)  # >>>> ['м', 'а', 'й']  

# list_1 =['A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R', 'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т']
#            0    1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18
# list_2 =['D', 'G', 'Д', 'К', 'Л', 'М', 'П', 'У']
# list_3 =['B', 'C', 'M', 'P', 'Б', 'Г', 'Ё', 'Ь', 'Я']
# list_4 =['F', 'H', 'V', 'W', 'Y', 'Й', 'Ы']
# list_5 =['K', 'Ж', 'З', 'Х', 'Ц', 'Ч']
# list_8 =['J', 'X', 'Ш', 'Э', 'Ю']
# list_10 =['Q', 'Z', 'Ф', 'Щ', 'Ъ']

list_1 =[[0], ['A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R', 'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т'],
['D', 'G', 'Д', 'К', 'Л', 'М', 'П', 'У'], ['B', 'C', 'M', 'P', 'Б', 'Г', 'Ё', 'Ь', 'Я'], ['F', 'H', 'V', 'W', 'Y', 'Й', 'Ы'],
['K', 'Ж', 'З', 'Х', 'Ц', 'Ч'], [0], [0], ['J', 'X', 'Ш', 'Э', 'Ю'], [0], ['Q', 'Z', 'Ф', 'Щ', 'Ъ']]

t=0
count=0
while t <len(char_list):
    v = char_list[t]
    for i, row in enumerate(list_1):
        for j, element in enumerate(row):
            if element == v.upper():
                 count = count+i
    t = t+1
print(count)
